app/views/articles/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 2]]
---
<%= render partial: 'comments/form' %>
<h3>Comments (<%= @article.comments.size %>)</h3>